In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("c:/DP_setup/test1.csv")

In [5]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.head()

   A  B  C
0  1  2  3
1  4  5  6

In [10]:
header=df.keys()

In [23]:
list(df.columns.values)

['A', 'B', 'C']

In [24]:
df.iloc[0,0]

1

In [26]:
list(zip("A",df["A"]))

[('A', 1)]

In [29]:
list(zip("A",df.A))

[('A', 1)]

In [31]:
df.to_json('temp.json', orient='records', lines=True)

TypeError: 'NoneType' object is not iterable

In [42]:
df1=pd.read_csv("c:/DP_setup/test2.txt")

In [43]:
df2=pd.read_csv("c:/DP_setup/test3.txt")

In [44]:
df1

   id  name   location
0   1    aa       pune
1   2    bb     mumbai
2   3    cc        NaN
3   4   NaN  bangalore

In [45]:
df2

   id      dept
0   3        it
1   2   account
2   5       edu

In [49]:
pd.merge(df1,df2,on="id",how="inner")

   id  name  location      dept
0   2    bb    mumbai   account
1   3    cc       NaN        it

In [58]:
df_mk=pd.merge(df1,df2,on="id",how="left")

In [57]:
df_m[df_m.dept.notnull()]

   id  name  location      dept
1   2    bb    mumbai   account
2   3    cc       NaN        it

In [59]:
df_m.dropna()

   id  name  location      dept
1   2    bb    mumbai   account